---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DecalFailures
source: html/63233581-994c-e5d1-87cb-57ccb34df082.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DecalFailures

Failures about Decal.

## Syntax (C#)
```csharp
public static class DecalFailures
```